a = input("请输入8位数字格式，如20230901：")
m = a[4:6]
d = a[6:8]
print(f"{a[0:4]}年{m}月{d}日")

month_dict = {
        "01": "January","02": "February","03": "March", "04": "April","05": "May",
        "06": "June","07": "July","08": "August","09": "September","10": "October",
        "11": "November","12": "December"
    }
day_dict = {
        "01": "1st","02": "2nd","03": "3rd","04": "4th","05": "5th","06": "6th","07": "7th",
        "08": "8th","09": "9th","10": "10th","11": "11th","12": "12th","13": "13th","14": "14th",
        "15": "15th","16": "16th","17": "17th","18": "18th","19": "19th","20": "20th",
        "21": "21st","22": "22nd","23": "23rd","24": "24th","25": "25th","26": "26th",
        "27": "27th","28": "28th","29": "29th","30": "30th","31": "31st"
    }
print(f"{month_dict[m]}\\{day_dict[d]}\\{a[0:4]}")